tests/com/l7tech/service/resources/bug3747_dsig_xpath.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header xmlns:wsu="http://schemas.xmlsoap.org/ws/2003/06/utility" wsu:Id="Id-6976904814793563191-11801174422850">
    <wsse:Security xmlns:wsse="http://schemas.xmlsoap.org/ws/2003/06/secext">
      <wsse:BinarySecurityToken
              wsu:Id="bst"
              ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
              EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">
        MIIBvDCCAWqgAwIBAgIQDFGFtl3dL7BPKEbT5sG2ojAJBgUrDgMCHQUAMBYxFDASBgNVBAMTC1Jv
        b3QgQWdlbmN5MB4XDTA2MDYyMTE1MDUwMFoXDTM5MTIzMTIzNTk1OVowHzEdMBsGA1UEAxMUV1NF
        MlF1aWNrU3RhcnRTZXJ2ZXIwgZ8wDQYJKoZIhvcNAQEBBQADgY0AMIGJAoGBALY0qgAnibfCe2Hd
        JL3H+HWLvl53qOl8J4wQ9l0lgU4m4rQXm+ccGj1Nb4ybCpZN0ZV1Brl76d6yEjYCune02J7029yb
        2S1Ac2ZAkZHZsYpj89wxOuJ98dZ/RDEV0+x/wCmAb/tFvpR7t0x465Q3YPr6sm7+12gKIjxq8V0z
        tnhhAgMBAAGjSzBJMEcGA1UdAQRAMD6AEBLkCS0GHR1PAI1hIdwWZGOhGDAWMRQwEgYDVQQDEwtS
        b290IEFnZW5jeYIQBjdsAKoAZIoRz7jUqlw19DAJBgUrDgMCHQUAA0EAIth9LxqRXfHvVwB9bmqa
        NvAaZF9mpiuckW3hcT4DZWYQ1xUtj5y1l38CVfVfC6whIZorpclc//qjtK9Xk3WdKw==
      </wsse:BinarySecurityToken>
      <dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#" Id="WSE2QuickStartServer">
        <dsig:SignedInfo>
          <dsig:CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
          <dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
          <dsig:Reference URI="">
            <dsig:Transforms>
              <dsig:Transform Algorithm="http://www.w3.org/TR/1999/REC-xpath-19991116">
                <dsig:XPath xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">ancestor-or-self::soap:Body</dsig:XPath>
              </dsig:Transform>
              <dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#"/>
            </dsig:Transforms>
            <dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
            <dsig:DigestValue>K/Rc50z5IORkgFSxX2UUvZ3vF+w=</dsig:DigestValue>
          </dsig:Reference>
        </dsig:SignedInfo>
        <dsig:SignatureValue>
        kG1nb2NNmqRzpouXU+56yYiZOvPT4UZs/3ls2YOP738fP+5j/KTaDG8zzIKBoaia7bDbA+IvmsGo
        W1Ip2kM5SuIz+hxyVDlCaK1lu7FpeACT8aOvXbf/i6pUeElaLjopZSR8JQpgKFnb3N9OmtFafrgC
        KYGOslhsXUj2sboy59o=
      </dsig:SignatureValue>
        <dsig:KeyInfo>
          <wsse:SecurityTokenReference>
              <wsse:Reference URI="#bst"/>
          </wsse:SecurityTokenReference>
        </dsig:KeyInfo>
      </dsig:Signature>
    </wsse:Security>
  </soap:Header>
  <soap:Body>
    <GetExchangeRateReportForCountries xmlns="ws://imf/ExchangeRateReport">
      <countries>
        <string>India</string>
      </countries>
      <fromDate>3/25/2007</fromDate>
      <toDate>04/05/2007</toDate>
      <exchangeRateType>SDRs per currency unit</exchangeRateType>
    </GetExchangeRateReportForCountries>
  </soap:Body>
</soap:Envelope>

